app/Controllers/Articulos.php

SELECT *
FROM `articulos`
---
    public function ver_articulos(): string
    {
        $modelo = new ArticulosModel();

        $articulos = $modelo->findAll();

INSERT INTO `articulos` (`nombre`, `marca`, `precio`) VALUES ('asdf', 'asdf', 'asdf')
---
    public function guardar()
    {
        $data = [];
        $data['nombre'] = $this->request->getPost('nombre');
        $data['marca'] = $this->request->getPost('marca');
        $data['precio'] = $this->request->getPost('precio');

        $imagen = $this->request->getFile('archivo');
        $nombreAleatorio = $imagen->getRandomName();
        $imagen->move('../public/uploads', $nombreAleatorio);

        $modelo = model(ArticulosModel::class);

        if ($modelo->save($data)) {