app/Controllers/Usuarios.php

INSERT INTO `usuarios` (`nombre`, `contraseña`) VALUES ('tremendopito69', '1234')
---
    public function guardar_usuario()
    {
        $data = [];
        $data['nombre'] = $this->request->getPost('nombre');
        $data['contraseña'] = $this->request->getPost('contraseña');

        $modelo = model(UsuariosModel::class);
        if ($modelo->save($data))